[Killed] BlockStatement
src/lambda.ts:69:36
   console.debug(JSON.stringify(event, null, 2));
   const { detail } = event;
 
-  if (!shouldTriggerEvent(detail)) {
-    console.log("Did not match pizza criteria, returning");
-    return {
-      statusCode: 200,
-      body: JSON.stringify({ message: "Did not trigger event" }),
-    };
-  }
+  if (!shouldTriggerEvent(detail)) {}
   const { zip, time } = resolvePizzaLocationAndDetails(detail);
   const isSimulation = detail.DeviceId === "fake-tracker";
killedBy: Does not trigger event when no data
statusReason: Cannot read properties of undefined (reading 'toLowerCase')

[Killed] ConditionalExpression
src/lambda.ts:69:7
   console.debug(JSON.stringify(event, null, 2));
   const { detail } = event;
 
-  if (!shouldTriggerEvent(detail)) {
+  if (false) {
     console.log("Did not match pizza criteria, returning");
     return {
killedBy: Does not trigger event when no data
statusReason: Cannot read properties of undefined (reading 'toLowerCase')

[Killed] ObjectLiteral
src/lambda.ts:71:12
 
   if (!shouldTriggerEvent(detail)) {
     console.log("Did not match pizza criteria, returning");
-    return {
-      statusCode: 200,
-      body: JSON.stringify({ message: "Did not trigger event" }),
-    };
+    return {};
   }
   const { zip, time } = resolvePizzaLocationAndDetails(detail);
killedBy: Does not trigger event when no data
statusReason: expected undefined to be 200 // Object.is equality

[Killed] ObjectLiteral
src/lambda.ts:73:28
     console.log("Did not match pizza criteria, returning");
     return {
       statusCode: 200,
-      body: JSON.stringify({ message: "Did not trigger event" }),
+      body: JSON.stringify({}),
     };
   }
killedBy: Does not trigger event when no data
statusReason: expected '{}' to be '{"message":"Did not trigger event"}' // Object.is equality

[Killed] StringLiteral
src/lambda.ts:73:39
     console.log("Did not match pizza criteria, returning");
     return {
       statusCode: 200,
-      body: JSON.stringify({ message: "Did not trigger event" }),
+      body: JSON.stringify({ message: "" }),
     };
   }
killedBy: Does not trigger event when no data
statusReason: expected '{"message":""}' to be '{"message":"Did not trigger event"}' // Object.is equality

[NoCoverage] ConditionalExpression
src/lambda.ts:77:24
     };
   }
   const { zip, time } = resolvePizzaLocationAndDetails(detail);
-  const isSimulation = detail.DeviceId === "fake-tracker";
+  const isSimulation = false;
   const { SPOT_PUSH_MATT_SUB } = process.env;
   const sub: webpush.PushSubscription = JSON.parse(SPOT_PUSH_MATT_SUB!);

[NoCoverage] EqualityOperator
src/lambda.ts:77:24
     };
   }
   const { zip, time } = resolvePizzaLocationAndDetails(detail);
-  const isSimulation = detail.DeviceId === "fake-tracker";
+  const isSimulation = detail.DeviceId !== "fake-tracker";
   const { SPOT_PUSH_MATT_SUB } = process.env;
   const sub: webpush.PushSubscription = JSON.parse(SPOT_PUSH_MATT_SUB!);

[NoCoverage] BooleanLiteral
src/lambda.ts:82:47
   const sub: webpush.PushSubscription = JSON.parse(SPOT_PUSH_MATT_SUB!);
   try {
     const results = await main(
-      { time, zip, isSimulation, recordVideo: true },
+      { time, zip, isSimulation, recordVideo: false },
       {
         args,

[NoCoverage] ObjectLiteral
src/lambda.ts:82:7
   const sub: webpush.PushSubscription = JSON.parse(SPOT_PUSH_MATT_SUB!);
   try {
     const results = await main(
-      { time, zip, isSimulation, recordVideo: true },
+      {},
       {
         args,

[NoCoverage] BooleanLiteral
src/lambda.ts:85:19
       { time, zip, isSimulation, recordVideo: true },
       {
         args,
-        headless: true,
+        headless: false,
       },
     );

[NoCoverage] ConditionalExpression
src/lambda.ts:89:9
       },
     );
     console.log(`Completed with result ${JSON.stringify(results)}`);
-    if (results.video) {
+    if (false) {
       await uploadVideo(results.video);
     }

[NoCoverage] BlockStatement
src/lambda.ts:89:24
       },
     );
     console.log(`Completed with result ${JSON.stringify(results)}`);
-    if (results.video) {
-      await uploadVideo(results.video);
-    }
+    if (results.video) {}
     if (results.simulation) {
       const result = await sendPushEvent(sub, "Pizza simulation");

[NoCoverage] ConditionalExpression
src/lambda.ts:92:9
     if (results.video) {
       await uploadVideo(results.video);
     }
-    if (results.simulation) {
+    if (true) {
       const result = await sendPushEvent(sub, "Pizza simulation");
       console.log("sent dummy notification");

[NoCoverage] ConditionalExpression
src/lambda.ts:92:9
     if (results.video) {
       await uploadVideo(results.video);
     }
-    if (results.simulation) {
+    if (false) {
       const result = await sendPushEvent(sub, "Pizza simulation");
       console.log("sent dummy notification");

[NoCoverage] StringLiteral
src/lambda.ts:93:47
       await uploadVideo(results.video);
     }
     if (results.simulation) {
-      const result = await sendPushEvent(sub, "Pizza simulation");
+      const result = await sendPushEvent(sub, "");
       console.log("sent dummy notification");
       console.log(result.statusCode);

[NoCoverage] BlockStatement
src/lambda.ts:97:12
       console.log("sent dummy notification");
       console.log(result.statusCode);
       console.log(result.body);
-    } else {
-      await sendPushEvent(
-        sub,
-        `🍕🍕🍕🍕🍕 Pizza Ordered for ${time} to zip ${zip} 🍕🍕🍕🍕🍕`,
-      );
-      await sendDiscordAnnouncement(
-        event.detail.DeviceId,
-        time,
-        zip,
-        event.detail.GeofenceId,
-        event.detail.EventType,
-      );
-      console.log("sent real notifications");
-    }
+    } else {}
 
     return {

[NoCoverage] StringLiteral
src/lambda.ts:100:9
     } else {
       await sendPushEvent(
         sub,
-        `🍕🍕🍕🍕🍕 Pizza Ordered for ${time} to zip ${zip} 🍕🍕🍕🍕🍕`,
+        ``
       );
       await sendDiscordAnnouncement(

[NoCoverage] ObjectLiteral
src/lambda.ts:112:12
       console.log("sent real notifications");
     }
 
-    return {
-      statusCode: 200,
-      body: JSON.stringify(event, null, 2),
-    };
+    return {};
   } catch (e) {
     console.error("Failed the request process");

[NoCoverage] BlockStatement
src/lambda.ts:116:15
       statusCode: 200,
       body: JSON.stringify(event, null, 2),
     };
-  } catch (e) {
-    console.error("Failed the request process");
-    console.error(e);
-    if (!isSimulation) {
-      await sendPushEvent(sub, "Failed to order pizza");
-    }
-    throw e;
-  }
+  } catch (e) {}
 };
 

[NoCoverage] BooleanLiteral
src/lambda.ts:119:9
   } catch (e) {
     console.error("Failed the request process");
     console.error(e);
-    if (!isSimulation) {
+    if (isSimulation) {
       await sendPushEvent(sub, "Failed to order pizza");
     }

[NoCoverage] ConditionalExpression
src/lambda.ts:119:9
   } catch (e) {
     console.error("Failed the request process");
     console.error(e);
-    if (!isSimulation) {
+    if (true) {
       await sendPushEvent(sub, "Failed to order pizza");
     }

[Survived] BlockStatement
src/lambda.ts:126:51
   }
 };
 
-function shouldTriggerEvent(detail: GeofenceType) {
-  if (
-    detail.DeviceId === "fake-tracker" &&
-    detail.EventType === "EXIT" &&
-    detail.GeofenceId.toLowerCase() === "home"
-  ) {
-    return true;
-  }
-
-  const supportedAction = "EXIT";
-  const supportedFences = ["arlington"];
-
-  return (
-    detail.EventType === supportedAction &&
-    supportedFences.includes(detail.GeofenceId.toLowerCase())
-  );
-}
+function shouldTriggerEvent(detail: GeofenceType) {}
 async function sendDiscordAnnouncement(
   deviceId: string,

[Killed] ConditionalExpression
src/lambda.ts:128:5
 
 function shouldTriggerEvent(detail: GeofenceType) {
   if (
-    detail.DeviceId === "fake-tracker" &&
-    detail.EventType === "EXIT" &&
-    detail.GeofenceId.toLowerCase() === "home"
+    true
   ) {
     return true;
killedBy: Does not trigger event when no data
statusReason: Cannot read properties of undefined (reading 'toLowerCase')

[Killed] ConditionalExpression
src/lambda.ts:128:5
 
 function shouldTriggerEvent(detail: GeofenceType) {
   if (
-    detail.DeviceId === "fake-tracker" &&
-    detail.EventType === "EXIT" &&
+    true &&
     detail.GeofenceId.toLowerCase() === "home"
   ) {
killedBy: Does not trigger event when no data
statusReason: Cannot read properties of undefined (reading 'toLowerCase')

[NoCoverage] EqualityOperator
src/lambda.ts:129:5
 function shouldTriggerEvent(detail: GeofenceType) {
   if (
     detail.DeviceId === "fake-tracker" &&
-    detail.EventType === "EXIT" &&
+    detail.EventType !== "EXIT" &&
     detail.GeofenceId.toLowerCase() === "home"
   ) {

[NoCoverage] ConditionalExpression
src/lambda.ts:129:5
 function shouldTriggerEvent(detail: GeofenceType) {
   if (
     detail.DeviceId === "fake-tracker" &&
-    detail.EventType === "EXIT" &&
+    true &&
     detail.GeofenceId.toLowerCase() === "home"
   ) {

[NoCoverage] EqualityOperator
src/lambda.ts:130:5
   if (
     detail.DeviceId === "fake-tracker" &&
     detail.EventType === "EXIT" &&
-    detail.GeofenceId.toLowerCase() === "home"
+    detail.GeofenceId.toLowerCase() !== "home"
   ) {
     return true;

[NoCoverage] MethodExpression
src/lambda.ts:130:5
   if (
     detail.DeviceId === "fake-tracker" &&
     detail.EventType === "EXIT" &&
-    detail.GeofenceId.toLowerCase() === "home"
+    detail.GeofenceId.toUpperCase() === "home"
   ) {
     return true;

[NoCoverage] BlockStatement
src/lambda.ts:131:5
     detail.DeviceId === "fake-tracker" &&
     detail.EventType === "EXIT" &&
     detail.GeofenceId.toLowerCase() === "home"
-  ) {
-    return true;
-  }
+  ) {}
 
   const supportedAction = "EXIT";

[Killed] ConditionalExpression
src/lambda.ts:139:5
   const supportedFences = ["arlington"];
 
   return (
-    detail.EventType === supportedAction &&
-    supportedFences.includes(detail.GeofenceId.toLowerCase())
+    true
   );
 }
killedBy: Does not trigger event when no data
statusReason: Cannot read properties of undefined (reading 'toLowerCase')

[Killed] ConditionalExpression
src/lambda.ts:139:5
   const supportedFences = ["arlington"];
 
   return (
-    detail.EventType === supportedAction &&
+    true &&
     supportedFences.includes(detail.GeofenceId.toLowerCase())
   );
killedBy: Does not trigger event when no data
statusReason: Cannot read properties of undefined (reading 'toLowerCase')

[Survived] MethodExpression
src/lambda.ts:140:30
 
   return (
     detail.EventType === supportedAction &&
-    supportedFences.includes(detail.GeofenceId.toLowerCase())
+    supportedFences.includes(detail.GeofenceId.toUpperCase())
   );
 }

[NoCoverage] BlockStatement
src/lambda.ts:149:3
   zip: string,
   geofence: string,
   action: string,
-) {
-  const url = process.env.CASEYS_DISCORD_WEBHOOK_URL;
-  await fetch(url!, {
-    headers: {
-      "Content-Type": "application/json",
-    },
-    method: "POST",
-    body: JSON.stringify({
-      content: `Pizza ordered for device ${deviceId} from zip ${zip} scheduled for ${time}, based on ${action} from geofence ${geofence}`,
-    }),
-  });
-}
+) {}
 
 type Mapping = {

[NoCoverage] StringLiteral
src/lambda.ts:172:12
 } {
   const mappings: { [k: string]: Mapping } = {
     arlington: {
-      zip: "68064",
+      zip: "",
       distanceToTravel: 14.2,
     },

[NoCoverage] ObjectLiteral
src/lambda.ts:175:11
       zip: "68064",
       distanceToTravel: 14.2,
     },
-    home: {
-      zip: "68104",
-      distanceToTravel: 40,
-    },
+    home: {},
   };
   const fenceId = detail.GeofenceId.toLowerCase();

[NoCoverage] StringLiteral
src/lambda.ts:176:12
       distanceToTravel: 14.2,
     },
     home: {
-      zip: "68104",
+      zip: "",
       distanceToTravel: 40,
     },

[NoCoverage] MethodExpression
src/lambda.ts:180:19
       distanceToTravel: 40,
     },
   };
-  const fenceId = detail.GeofenceId.toLowerCase();
+  const fenceId = detail.GeofenceId.toUpperCase();
   const locationSettings = mappings[fenceId];
 

[NoCoverage] BooleanLiteral
src/lambda.ts:183:7
   const fenceId = detail.GeofenceId.toLowerCase();
   const locationSettings = mappings[fenceId];
 
-  if (!locationSettings) {
+  if (locationSettings) {
     console.warn(
       "Could not resolve pizza locations, just using defaults from env",

[NoCoverage] BlockStatement
src/lambda.ts:183:26
   const fenceId = detail.GeofenceId.toLowerCase();
   const locationSettings = mappings[fenceId];
 
-  if (!locationSettings) {
-    console.warn(
-      "Could not resolve pizza locations, just using defaults from env",
-    );
-    const { CASEYS_ZIP, CASEYS_TIME } = process.env;
-    return { zip: CASEYS_ZIP!, time: CASEYS_TIME! };
-  }
+  if (!locationSettings) {}
 
   const time = getCheckoutTime(

[NoCoverage] ObjectLiteral
src/lambda.ts:196:10
     detail.SampleTime,
   );
 
-  return { zip: locationSettings.zip, time };
+  return {};
 }
 

[NoCoverage] BlockStatement
src/lambda.ts:199:43
   return { zip: locationSettings.zip, time };
 }
 
-async function uploadVideo(video: string) {
-  const key = basename(video);
-  console.log(`ready to save file ${video} as name ${key}`)
-
-  try {
-    const Body = await readFile(video);
-    const client = new S3Client();
-    const upload = new PutObjectCommand({
-      Bucket: 'spot-caseys-pizza',
-      Body,
-      Key: key
-    });
-    const result = await client.send(upload);
-    console.log('Sent video');
-    console.log(result)
-  } catch (e) {
-    console.error('could not send video');
-    console.error(e);
-
-  }
-}
+async function uploadVideo(video: string) {}
 
 

[NoCoverage] BlockStatement
src/lambda.ts:203:7
   const key = basename(video);
   console.log(`ready to save file ${video} as name ${key}`)
 
-  try {
-    const Body = await readFile(video);
-    const client = new S3Client();
-    const upload = new PutObjectCommand({
-      Bucket: 'spot-caseys-pizza',
-      Body,
-      Key: key
-    });
-    const result = await client.send(upload);
-    console.log('Sent video');
-    console.log(result)
-  } catch (e) {
+  try {} catch (e) {
     console.error('could not send video');
     console.error(e);

[NoCoverage] ObjectLiteral
src/lambda.ts:206:41
   try {
     const Body = await readFile(video);
     const client = new S3Client();
-    const upload = new PutObjectCommand({
-      Bucket: 'spot-caseys-pizza',
-      Body,
-      Key: key
-    });
+    const upload = new PutObjectCommand({});
     const result = await client.send(upload);
     console.log('Sent video');

[NoCoverage] StringLiteral
src/lambda.ts:207:15
     const Body = await readFile(video);
     const client = new S3Client();
     const upload = new PutObjectCommand({
-      Bucket: 'spot-caseys-pizza',
+      Bucket: "",
       Body,
       Key: key

[NoCoverage] BlockStatement
src/lambda.ts:214:15
     const result = await client.send(upload);
     console.log('Sent video');
     console.log(result)
-  } catch (e) {
-    console.error('could not send video');
-    console.error(e);
-
-  }
+  } catch (e) {}
 }
 
