[NoCoverage] BlockStatement
src/lambdas.test copy.ts:7:17
 import * as push from './push';
 import { SendResult } from "web-push";
 
-afterEach(() => {
-    vi.restoreAllMocks()
-})
+afterEach(() => {})
 
 test('Does not trigger event when no data', async () => {

[NoCoverage] BlockStatement
src/lambdas.test copy.ts:11:57
     vi.restoreAllMocks()
 })
 
-test('Does not trigger event when no data', async () => {
-    const result = await handler({detail:{}}, {} as any, () => {});
-    expect(result.statusCode).toBe(200);
-    expect(result.body).toBe('{"message":"Did not trigger event"}');
-});
+test('Does not trigger event when no data', async () => {});
 
 test('Does trigger event for Arlington', async () => {

[NoCoverage] BlockStatement
src/lambdas.test copy.ts:17:54
     expect(result.body).toBe('{"message":"Did not trigger event"}');
 });
 
-test('Does trigger event for Arlington', async () => {
-    vi.stubGlobal('process', {env: {SPOT_PUSH_MATT_SUB: '{"endpoint":"hello"}'}});
-    let playwrightSpy = vi.spyOn(playwright, 'main');
-    playwrightSpy.mockImplementationOnce((_,__) => {
-        return Promise.resolve({
-            video: '',
-            simulation: true
-        })
-    })
-    
-    let pushSpy = vi.spyOn(push, 'sendPushEvent');
-    pushSpy.mockImplementation((_,__) =>{
-        return Promise.resolve({} as SendResult);
-    })
-
-    const input = {detail:{
-        EventType: 'EXIT',
-        GeofenceId: 'Arlington',
-        SampleTime: '2024-02-17T22:23:24Z'
-    }};
-    const result = await handler(input, {} as any, () => {});
-    expect(playwrightSpy).toHaveBeenCalledOnce();
-    expect(result.statusCode).toBe(200);
-    expect(JSON.parse(result.body)).toEqual(input);
-});
+test('Does trigger event for Arlington', async () => {});

[NoCoverage] ObjectLiteral
src/lambdas.test copy.ts:18:36
 });
 
 test('Does trigger event for Arlington', async () => {
-    vi.stubGlobal('process', {env: {SPOT_PUSH_MATT_SUB: '{"endpoint":"hello"}'}});
+    vi.stubGlobal('process', {env: {}});
     let playwrightSpy = vi.spyOn(playwright, 'main');
     playwrightSpy.mockImplementationOnce((_,__) => {

[NoCoverage] StringLiteral
src/lambdas.test copy.ts:18:19
 });
 
 test('Does trigger event for Arlington', async () => {
-    vi.stubGlobal('process', {env: {SPOT_PUSH_MATT_SUB: '{"endpoint":"hello"}'}});
+    vi.stubGlobal("", {env: {SPOT_PUSH_MATT_SUB: '{"endpoint":"hello"}'}});
     let playwrightSpy = vi.spyOn(playwright, 'main');
     playwrightSpy.mockImplementationOnce((_,__) => {

[NoCoverage] StringLiteral
src/lambdas.test copy.ts:19:46
 
 test('Does trigger event for Arlington', async () => {
     vi.stubGlobal('process', {env: {SPOT_PUSH_MATT_SUB: '{"endpoint":"hello"}'}});
-    let playwrightSpy = vi.spyOn(playwright, 'main');
+    let playwrightSpy = vi.spyOn(playwright, "");
     playwrightSpy.mockImplementationOnce((_,__) => {
         return Promise.resolve({

[NoCoverage] BlockStatement
src/lambdas.test copy.ts:20:52
 test('Does trigger event for Arlington', async () => {
     vi.stubGlobal('process', {env: {SPOT_PUSH_MATT_SUB: '{"endpoint":"hello"}'}});
     let playwrightSpy = vi.spyOn(playwright, 'main');
-    playwrightSpy.mockImplementationOnce((_,__) => {
-        return Promise.resolve({
-            video: '',
-            simulation: true
-        })
-    })
+    playwrightSpy.mockImplementationOnce((_,__) => {})
     
     let pushSpy = vi.spyOn(push, 'sendPushEvent');

[NoCoverage] ObjectLiteral
src/lambdas.test copy.ts:21:32
     vi.stubGlobal('process', {env: {SPOT_PUSH_MATT_SUB: '{"endpoint":"hello"}'}});
     let playwrightSpy = vi.spyOn(playwright, 'main');
     playwrightSpy.mockImplementationOnce((_,__) => {
-        return Promise.resolve({
-            video: '',
-            simulation: true
-        })
+        return Promise.resolve({})
     })
     

[NoCoverage] StringLiteral
src/lambdas.test copy.ts:22:20
     let playwrightSpy = vi.spyOn(playwright, 'main');
     playwrightSpy.mockImplementationOnce((_,__) => {
         return Promise.resolve({
-            video: '',
+            video: "Stryker was here!",
             simulation: true
         })

[NoCoverage] BooleanLiteral
src/lambdas.test copy.ts:23:25
     playwrightSpy.mockImplementationOnce((_,__) => {
         return Promise.resolve({
             video: '',
-            simulation: true
+            simulation: false
         })
     })

[NoCoverage] StringLiteral
src/lambdas.test copy.ts:27:34
         })
     })
     
-    let pushSpy = vi.spyOn(push, 'sendPushEvent');
+    let pushSpy = vi.spyOn(push, "");
     pushSpy.mockImplementation((_,__) =>{
         return Promise.resolve({} as SendResult);

[NoCoverage] BlockStatement
src/lambdas.test copy.ts:28:41
     })
     
     let pushSpy = vi.spyOn(push, 'sendPushEvent');
-    pushSpy.mockImplementation((_,__) =>{
-        return Promise.resolve({} as SendResult);
-    })
+    pushSpy.mockImplementation((_,__) =>{})
 
     const input = {detail:{
