[NoCoverage] BlockStatement
src/local-test-order.ts:7:14
 
 const { CASEYS_ZIP, CASEYS_TIME } = process.env;
 const { SPOT_PUSH_MATT_SUB } = process.env;
-(async () => {
-  const sub: webpush.PushSubscription = JSON.parse(SPOT_PUSH_MATT_SUB!);
-  try {
-    const result = await main(
-      {
-        time: CASEYS_TIME!,
-        zip: CASEYS_ZIP!,
-        isSimulation: true,
-        recordVideo: true,
-      },
-      { headless: true },
-    );
-    if (result.simulation) {
-      console.log("was a simulation");
-      // sendPushEvent(sub, `Test simulation successful`)
-    } else {
-      console.log("you better get that pizza");
-    }
-    console.log(`video available at ${result.video}`);
-  } catch (e) {
-    sendPushEvent(sub, `Failed ${e}`);
-  }
-})();
+(async () => {})();
 

[NoCoverage] BlockStatement
src/local-test-order.ts:9:7
 const { SPOT_PUSH_MATT_SUB } = process.env;
 (async () => {
   const sub: webpush.PushSubscription = JSON.parse(SPOT_PUSH_MATT_SUB!);
-  try {
-    const result = await main(
-      {
-        time: CASEYS_TIME!,
-        zip: CASEYS_ZIP!,
-        isSimulation: true,
-        recordVideo: true,
-      },
-      { headless: true },
-    );
-    if (result.simulation) {
-      console.log("was a simulation");
-      // sendPushEvent(sub, `Test simulation successful`)
-    } else {
-      console.log("you better get that pizza");
-    }
-    console.log(`video available at ${result.video}`);
-  } catch (e) {
+  try {} catch (e) {
     sendPushEvent(sub, `Failed ${e}`);
   }

[NoCoverage] ObjectLiteral
src/local-test-order.ts:11:7
   const sub: webpush.PushSubscription = JSON.parse(SPOT_PUSH_MATT_SUB!);
   try {
     const result = await main(
-      {
-        time: CASEYS_TIME!,
-        zip: CASEYS_ZIP!,
-        isSimulation: true,
-        recordVideo: true,
-      },
+      {},
       { headless: true },
     );

[NoCoverage] BooleanLiteral
src/local-test-order.ts:14:23
       {
         time: CASEYS_TIME!,
         zip: CASEYS_ZIP!,
-        isSimulation: true,
+        isSimulation: false,
         recordVideo: true,
       },

[NoCoverage] BooleanLiteral
src/local-test-order.ts:15:22
         time: CASEYS_TIME!,
         zip: CASEYS_ZIP!,
         isSimulation: true,
-        recordVideo: true,
+        recordVideo: false,
       },
       { headless: true },

[NoCoverage] BooleanLiteral
src/local-test-order.ts:17:19
         isSimulation: true,
         recordVideo: true,
       },
-      { headless: true },
+      { headless: false },
     );
     if (result.simulation) {

[NoCoverage] ObjectLiteral
src/local-test-order.ts:17:7
         isSimulation: true,
         recordVideo: true,
       },
-      { headless: true },
+      {},
     );
     if (result.simulation) {

[NoCoverage] ConditionalExpression
src/local-test-order.ts:19:9
       },
       { headless: true },
     );
-    if (result.simulation) {
+    if (false) {
       console.log("was a simulation");
       // sendPushEvent(sub, `Test simulation successful`)

[NoCoverage] ConditionalExpression
src/local-test-order.ts:19:9
       },
       { headless: true },
     );
-    if (result.simulation) {
+    if (true) {
       console.log("was a simulation");
       // sendPushEvent(sub, `Test simulation successful`)

[NoCoverage] BlockStatement
src/local-test-order.ts:22:12
     if (result.simulation) {
       console.log("was a simulation");
       // sendPushEvent(sub, `Test simulation successful`)
-    } else {
-      console.log("you better get that pizza");
-    }
+    } else {}
     console.log(`video available at ${result.video}`);
   } catch (e) {

[NoCoverage] BlockStatement
src/local-test-order.ts:26:15
       console.log("you better get that pizza");
     }
     console.log(`video available at ${result.video}`);
-  } catch (e) {
-    sendPushEvent(sub, `Failed ${e}`);
-  }
+  } catch (e) {}
 })();
 

[NoCoverage] StringLiteral
src/local-test-order.ts:27:24
     }
     console.log(`video available at ${result.video}`);
   } catch (e) {
-    sendPushEvent(sub, `Failed ${e}`);
+    sendPushEvent(sub, ``);
   }
 })();
