[Killed] BlockStatement
src/dates.ts:4:79
 import { addMinutes, isBefore, startOfHour } from "date-fns";
 import { formatInTimeZone } from "date-fns-tz";
 
-export function getCheckoutTime(distanceToTravel: number, sampleTime: string) {
-  const travelSpeed = 13;
-  const minutesToTravelDistance = Math.round(
-    (distanceToTravel / travelSpeed) * 60,
-  );
-  const eventTime = new Date(sampleTime);
-  const exactPickupTime = addMinutes(eventTime, minutesToTravelDistance);
-  console.log("exact pickup time", exactPickupTime);
-  const topOfHour = startOfHour(exactPickupTime);
-  let pickupTime = topOfHour;
-  let challenge = addMinutes(topOfHour, 15);
-  while (isBefore(challenge, exactPickupTime)) {
-    pickupTime = challenge;
-    challenge = addMinutes(pickupTime, 15);
-  }
-  console.log("found actual time ", pickupTime);
-  const time = formatInTimeZone(pickupTime, "America/Chicago", "hh:mm aa");
-  console.log("time found: ", time);
-  return time;
-}
+export function getCheckoutTime(distanceToTravel: number, sampleTime: string) {}
 
killedBy: checkout time testing
statusReason: expected undefined to deeply equal '12:30 PM'

[Killed] ArithmeticOperator
src/dates.ts:7:6
 export function getCheckoutTime(distanceToTravel: number, sampleTime: string) {
   const travelSpeed = 13;
   const minutesToTravelDistance = Math.round(
-    (distanceToTravel / travelSpeed) * 60,
+    (distanceToTravel * travelSpeed) * 60,
   );
   const eventTime = new Date(sampleTime);
killedBy: checkout time testing
statusReason: expected '04:00 AM' to deeply equal '12:30 PM'

[Killed] ArithmeticOperator
src/dates.ts:7:5
 export function getCheckoutTime(distanceToTravel: number, sampleTime: string) {
   const travelSpeed = 13;
   const minutesToTravelDistance = Math.round(
-    (distanceToTravel / travelSpeed) * 60,
+    distanceToTravel / travelSpeed / 60,
   );
   const eventTime = new Date(sampleTime);
killedBy: checkout time testing
statusReason: expected '11:30 AM' to deeply equal '12:30 PM'

[Killed] ConditionalExpression
src/dates.ts:15:10
   const topOfHour = startOfHour(exactPickupTime);
   let pickupTime = topOfHour;
   let challenge = addMinutes(topOfHour, 15);
-  while (isBefore(challenge, exactPickupTime)) {
+  while (false) {
     pickupTime = challenge;
     challenge = addMinutes(pickupTime, 15);
killedBy: checkout time testing
statusReason: expected '12:00 PM' to deeply equal '12:30 PM'

[Timeout] BlockStatement
src/dates.ts:15:48
   const topOfHour = startOfHour(exactPickupTime);
   let pickupTime = topOfHour;
   let challenge = addMinutes(topOfHour, 15);
-  while (isBefore(challenge, exactPickupTime)) {
-    pickupTime = challenge;
-    challenge = addMinutes(pickupTime, 15);
-  }
+  while (isBefore(challenge, exactPickupTime)) {}
   console.log("found actual time ", pickupTime);
   const time = formatInTimeZone(pickupTime, "America/Chicago", "hh:mm aa");

[Killed] StringLiteral
src/dates.ts:20:64
     challenge = addMinutes(pickupTime, 15);
   }
   console.log("found actual time ", pickupTime);
-  const time = formatInTimeZone(pickupTime, "America/Chicago", "hh:mm aa");
+  const time = formatInTimeZone(pickupTime, "America/Chicago", "");
   console.log("time found: ", time);
   return time;
killedBy: checkout time testing
statusReason: Cannot read properties of null (reading 'map')

[Killed] StringLiteral
src/dates.ts:20:45
     challenge = addMinutes(pickupTime, 15);
   }
   console.log("found actual time ", pickupTime);
-  const time = formatInTimeZone(pickupTime, "America/Chicago", "hh:mm aa");
+  const time = formatInTimeZone(pickupTime, "", "hh:mm aa");
   console.log("time found: ", time);
   return time;
killedBy: checkout time testing
statusReason: expected '05:30 PM' to deeply equal '12:30 PM'
