[Killed] ConditionalExpression
src/lambda.ts:69:7
   console.debug(JSON.stringify(event, null, 2));
   const { detail } = event;
 
-  if (!shouldTriggerEvent(detail)) {
+  if (true) {
     console.log("Did not match pizza criteria, returning");
     return {
killedBy: Does trigger event for Arlington
statusReason: expected "main" to be called once, but got 0 times
